// Задача 44. Введите первые N чисел Фибонначи . Первые два числа это 0 и 1.
// Число Фибонначи = каждое следуещее это сумма двух предыдущих.
Console.Clear();

int GetFromUser(string message)
{
    Console.WriteLine(message);
    int userInt = int.Parse(Console.ReadLine()!);
    return userInt;
}

string Fibbonachi(int number)
{

    for (int i = 0; i < number; i++)
    {
        
    }

}
